app/views/mylayouts/_sidebar.html.haml

SELECT "tags".* FROM "tags"
---
  %h3 Tags list
  - @tags = Tag.all

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 186 ORDER BY created_at desc LIMIT 5
---
    %h3 Your last posts
    - @user_posts = current_user.posts.order("created_at desc").limit(5)