app/views/posts/_form.html.haml

SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 1
SELECT COUNT(*) FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 1
---
    .text_field
    = f.fields_for :tags, @post.tags.empty? ? Tag.new : @post.tags do |tag_field|