app/views/posts/show.html.haml

    .tags
      - unless @post.tags.empty?
---
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" IN (1)
SELECT "tags".* FROM "tags"

    %h2 Comments
    - @post.blog_comments.each do |blog_comment|
      .comment
        .commenter
---
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."post_id" IN (1)
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 11