app/controllers/blog_comments_controller.rb

  def edit
    @blog_comment = current_user.blog_comments.find(params[:id])
---
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."user_id" = 1 AND "blog_comments"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @post = Post.find(params[:post_id])
    @blog_comment = @post.blog_comments.create(params[:blog_comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "blog_comments" ("body", "commenter", "created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Nice post"], ["commenter", nil], ["created_at", Tue, 18 Jun 2013 11:36:42 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 18 Jun 2013 11:36:42 UTC +00:00], ["user_id", 1]]

  def update
    @blog_comment = current_user.blog_comments.find(params[:id])
    @post = Post.find(params[:post_id])
    respond_to do |format|
      if @blog_comment.update_attributes(params[:blog_comment])
---
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."user_id" = 1 AND "blog_comments"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "blog_comments" SET "body" = 'Nice post 1', "updated_at" = '2013-06-18 14:32:21.313424' WHERE "blog_comments"."id" = 1