app/controllers/comments_controller.rb

  def edit
    @comment = current_user.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 2 AND "comments"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
    @comment.user = current_user
    @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "text"], ["commenter", "trying the user id"], ["created_at", Thu, 30 May 2013 09:18:35 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 30 May 2013 09:18:35 UTC +00:00], ["user_id", nil]]
UPDATE "comments" SET "user_id" = 1, "updated_at" = '2013-05-30 09:24:49.342831' WHERE "comments"."id" = 4

  def update
    @comment = current_user.comments.find(params[:id])
    @post = Post.find(params[:post_id])
    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 2 AND "comments"."id" = $1 LIMIT 1  [["id", "17"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "body" = 'asdasdsad', "updated_at" = '2013-05-30 11:35:41.312273' WHERE "comments"."id" = 17