app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title NOT LIKE '%hidden%' ) LIMIT 3 OFFSET 0
---
  def index
    @posts = Post.nothidden.page(params[:page]).per(3)