app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title NOT LIKE '%hidden%' ) ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (title NOT LIKE '%hidden%' )
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 186 ORDER BY created_at desc LIMIT 5
---
  def index
    @posts = Post.nothidden.order("created_at desc").page(params[:page]).per(5)
    if user_signed_in?
      @user_posts = current_user.posts.order("created_at desc").limit(5)

SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."post_id" IN (1)
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" IN (1)
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 AND (title NOT LIKE '%hidden%' ) LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at desc LIMIT 5
SELECT "tags".* FROM "tags"
---
  def show
    @post = Post.nothidden.includes([:blog_comments, :tags]).find(params[:id])
    @blog_comment = BlogComment.new
    if user_signed_in?
      @user_posts = current_user.posts.order("created_at desc").limit(5)
    end

    @posts = Post.nothidden.order("created_at desc")
    @tags = Tag.all

INSERT INTO "posts" ("body", "created_at", "data", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdf"], ["created_at", Wed, 29 May 2013 10:12:06 UTC +00:00], ["data", Wed, 29 May 2013 10:11:00 UTC +00:00], ["title", "12"], ["updated_at", Wed, 29 May 2013 10:12:06 UTC +00:00]]
---
  def create
    @post = current_user.posts.new(params[:post])
    @posts = current_user.posts
    #@post.user_id = current_user.id
    @tag = Tag.new
    #@tags = @post.tags.find_or_create_by_tag_word(:tag_word)

    respond_to do |format|
      if @posts.unapproved.count >= 3
        format.html { redirect_to posts_path, notice: 'You cant post more than 3 unapproved posts' }
      elsif @post.save

UPDATE "posts" SET "title" = '5', "body" = 'qwerqwe', "updated_at" = '2013-05-27 14:54:52.072912' WHERE "posts"."id" = 5
---
  def update
    if @post.update_attributes(params[:post])